
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        8 |          32 |            2 |
## Affected resources by action

|  Action  | Resources                                                                              |
|:--------:|:---------------------------------------------------------------------------------------|
|    🟢    | `module.management.aws_flow_log.vpc[0]`                                                |
|    🟢    | `module.management.aws_s3_bucket.vpc_flow_logs[0]`                                     |
|    🟢    | `module.management.aws_s3_bucket_lifecycle_configuration.vpc_flow_logs[0]`             |
|    🟢    | `module.management.aws_s3_bucket_public_access_block.public_access[0]`                 |
|    🟢    | `module.management.aws_s3_bucket_server_side_encryption_configuration.default[0]`      |
|    🟢    | `module.management.aws_s3_bucket_versioning.enabled[0]`                                |
|    🟢    | `module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.ssm[0]`        |
|    🟢    | `module.mail_twindb_com.module.instance-profile.aws_iam_role_policy_attachment.ssm[0]` |
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                                       |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                              |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                                         |
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix`                                 |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`                                       |
|    🟡    | `module.mail_twindb_com.aws_launch_template.postfix`                                   |
|    🟡    | `module.management.aws_default_route_table.default`                                    |
|    🟡    | `module.management.aws_default_security_group.default`                                 |
|    🟡    | `module.management.aws_eip.nat_eip["10.0.0.0/24"]`                                     |
|    🟡    | `module.management.aws_eip.nat_eip["10.0.2.0/24"]`                                     |
|    🟡    | `module.management.aws_internet_gateway.ig`                                            |
|    🟡    | `module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]`                              |
|    🟡    | `module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]`                              |
|    🟡    | `module.management.aws_route_table.all["10.0.0.0/24"]`                                 |
|    🟡    | `module.management.aws_route_table.all["10.0.1.0/24"]`                                 |
|    🟡    | `module.management.aws_route_table.all["10.0.2.0/24"]`                                 |
|    🟡    | `module.management.aws_route_table.all["10.0.3.0/24"]`                                 |
|    🟡    | `module.management.aws_subnet.all["10.0.0.0/24"]`                                      |
|    🟡    | `module.management.aws_subnet.all["10.0.1.0/24"]`                                      |
|    🟡    | `module.management.aws_subnet.all["10.0.2.0/24"]`                                      |
|    🟡    | `module.management.aws_subnet.all["10.0.3.0/24"]`                                      |
|    🟡    | `module.management.aws_vpc.vpc`                                                        |
|    🟡    | `module.management.aws_vpc_endpoint.s3`                                                |
|    🟡    | `module.terraform-aws-github-backup.aws_autoscaling_group.main`                        |
|    🟡    | `module.terraform-aws-github-backup.aws_launch_template.github-backup`                 |
|    🟡    | `module.vpn.aws_autoscaling_group.openvpn`                                             |
|    🟡    | `module.vpn.aws_launch_template.openvpn`                                               |
|    🟡    | `module.jumphost.module.jumphost_profile.aws_iam_role.profile`                         |
|    🟡    | `module.mail_twindb_com.module.instance-profile.aws_iam_role.profile`                  |
|    🟡    | `module.vpn.module.instance_profile.aws_iam_policy.profile`                            |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website`            |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`              |
|    🔴    | `module.management.aws_vpc_security_group_egress_rule.default[0]`                      |
|    🔴    | `module.management.aws_vpc_security_group_ingress_rule.default[0]`                     |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "20" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (11 unchanged blocks hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ image_id                             = "ami-0f852f6b9cdfac2a8" -> "ami-0d613de781286fbe7"
      ~ latest_version                       = 20 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "24" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ image_id                             = "ami-062e38232f4d4253b" -> "ami-043b59f1d11f8f189"
      ~ latest_version                       = 24 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
        tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.management.aws_default_route_table.default will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0d73383afeb6ad142"
      ~ tags                   = {
            "Name"              = "Main table for 10.0.0.0/22"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.0.0/22"
            "service"           = "management"
        }
      ~ tags_all               = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.management.aws_default_security_group.default will be updated in-place
  ~ resource "aws_default_security_group" "default" {
        id                     = "sg-08b960b85f5996100"
        name                   = "default"
      ~ tags                   = {
            "Name"              = "10.0.0.0/22 default"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "service"           = "management"
        }
      ~ tags_all               = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.management.aws_eip.nat_eip["10.0.0.0/24"] will be updated in-place
  ~ resource "aws_eip" "nat_eip" {
        id                       = "eipalloc-02b42e70d52a5db7f"
      ~ tags                     = {
            "Name"              = "Elastic IP for NAT gateway"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.0.0/24"
            "service"           = "management"
        }
      ~ tags_all                 = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # module.management.aws_eip.nat_eip["10.0.2.0/24"] will be updated in-place
  ~ resource "aws_eip" "nat_eip" {
        id                       = "eipalloc-0a3949a8a5f094171"
      ~ tags                     = {
            "Name"              = "Elastic IP for NAT gateway"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.2.0/24"
            "service"           = "management"
        }
      ~ tags_all                 = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # module.management.aws_flow_log.vpc[0] will be created
  + resource "aws_flow_log" "vpc" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "s3"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "created_by_module" = "infrahouse/service-network/aws"
          + "environment"       = "production"
          + "service"           = "management"
        }
      + tags_all                 = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/service-network/aws"
          + "environment"       = "production"
          + "service"           = "management"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-08e19d859c26d18b2"
    }

  # module.management.aws_internet_gateway.ig will be updated in-place
  ~ resource "aws_internet_gateway" "ig" {
        id       = "igw-079090e09ed5db582"
      ~ tags     = {
            "Name"              = "Internet gateway"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "service"           = "management"
        }
      ~ tags_all = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                                 = "nat-08fb9b52683277947"
      ~ tags                               = {
            "Name"              = "NAT gateway"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.0.0/24"
            "service"           = "management"
        }
      ~ tags_all                           = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                                 = "nat-0d4e2ee96452d86fe"
      ~ tags                               = {
            "Name"              = "NAT gateway"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.2.0/24"
            "service"           = "management"
        }
      ~ tags_all                           = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.management.aws_route_table.all["10.0.0.0/24"] will be updated in-place
  ~ resource "aws_route_table" "all" {
        id               = "rtb-04a16e74d5b12a338"
      ~ tags             = {
            "Name"              = "Table for 10.0.0.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.0.0/24"
            "service"           = "management"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_route_table.all["10.0.1.0/24"] will be updated in-place
  ~ resource "aws_route_table" "all" {
        id               = "rtb-067c30e65dd4108e9"
      ~ tags             = {
            "Name"              = "Table for 10.0.1.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.1.0/24"
            "service"           = "management"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_route_table.all["10.0.2.0/24"] will be updated in-place
  ~ resource "aws_route_table" "all" {
        id               = "rtb-0ac1c23091a58b0bd"
      ~ tags             = {
            "Name"              = "Table for 10.0.2.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.2.0/24"
            "service"           = "management"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_route_table.all["10.0.3.0/24"] will be updated in-place
  ~ resource "aws_route_table" "all" {
        id               = "rtb-032c75541921bd8f1"
      ~ tags             = {
            "Name"              = "Table for 10.0.3.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "residency"         = "10.0.3.0/24"
            "service"           = "management"
        }
      ~ tags_all         = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.management.aws_s3_bucket.vpc_flow_logs[0] will be created
  + resource "aws_s3_bucket" "vpc_flow_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "vpc-flow-logs-management-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "created_by_module" = "infrahouse/service-network/aws"
          + "environment"       = "production"
          + "service"           = "management"
        }
      + tags_all                    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/service-network/aws"
          + "environment"       = "production"
          + "service"           = "management"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.management.aws_s3_bucket_lifecycle_configuration.vpc_flow_logs[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "vpc_flow_logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete-old"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = false
            }

          + filter {
              + object_size_greater_than = 0
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }
        }
    }

  # module.management.aws_s3_bucket_public_access_block.public_access[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.management.aws_s3_bucket_server_side_encryption_configuration.default[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.management.aws_s3_bucket_versioning.enabled[0] will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.management.aws_subnet.all["10.0.0.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-0df885dcc99418799"
      ~ tags                                           = {
            "Name"              = "management: public 10.0.0.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "management"        = "true"
            "service"           = "management"
        }
      ~ tags_all                                       = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.management.aws_subnet.all["10.0.1.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-0f91dd2675e7a16c3"
      ~ tags                                           = {
            "Name"              = "management: private 10.0.1.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "management"        = "true"
            "service"           = "management"
        }
      ~ tags_all                                       = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.management.aws_subnet.all["10.0.2.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-04b8845d896c6ebde"
      ~ tags                                           = {
            "Name"              = "management: public 10.0.2.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "management"        = "true"
            "service"           = "management"
        }
      ~ tags_all                                       = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.management.aws_subnet.all["10.0.3.0/24"] will be updated in-place
  ~ resource "aws_subnet" "all" {
        id                                             = "subnet-06caf71c8b0afd909"
      ~ tags                                           = {
            "Name"              = "management: private 10.0.3.0/24"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "management"        = "true"
            "service"           = "management"
        }
      ~ tags_all                                       = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.management.aws_vpc.vpc will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                                   = "vpc-08e19d859c26d18b2"
      ~ tags                                 = {
            "Name"              = "VPC for management (production) 10.0.0.0/22"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "management"        = "true"
          + "module_version"    = "3.1.1"
            "service"           = "management"
        }
      ~ tags_all                             = {
          + "created_by_module" = "infrahouse/service-network/aws"
          + "module_version"    = "3.1.1"
            # (5 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.management.aws_vpc_endpoint.s3 will be updated in-place
  ~ resource "aws_vpc_endpoint" "s3" {
        id                         = "vpce-00762d3ea63723667"
      ~ tags                       = {
            "Name"              = "S3 Endpoint in management VPC"
          + "created_by_module" = "infrahouse/service-network/aws"
            "environment"       = "production"
            "service"           = "management"
        }
      ~ tags_all                   = {
          + "created_by_module" = "infrahouse/service-network/aws"
            # (4 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)
    }

  # module.management.aws_vpc_security_group_egress_rule.default[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_vpc_security_group_egress_rule" "default" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0e1eea4ce5b798046" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "Allow all traffic" -> null
      - id                     = "sgr-0e1eea4ce5b798046" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-08b960b85f5996100" -> null
      - security_group_rule_id = "sgr-0e1eea4ce5b798046" -> null
      - tags                   = {
          - "Name" = "outgoing traffic"
        } -> null
      - tags_all               = {
          - "Name"        = "outgoing traffic"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
    }

  # module.management.aws_vpc_security_group_ingress_rule.default[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_vpc_security_group_ingress_rule" "default" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-06140053abc62a119" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "Allow all traffic" -> null
      - id                     = "sgr-06140053abc62a119" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-08b960b85f5996100" -> null
      - security_group_rule_id = "sgr-06140053abc62a119" -> null
      - tags                   = {
          - "Name" = "incoming traffic"
        } -> null
      - tags_all               = {
          - "Name"        = "incoming traffic"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
    }

  # module.terraform-aws-github-backup.aws_autoscaling_group.main will be updated in-place
  ~ resource "aws_autoscaling_group" "main" {
        id                               = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        name                             = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "17" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.terraform-aws-github-backup.aws_launch_template.github-backup will be updated in-place
  ~ resource "aws_launch_template" "github-backup" {
        id                                   = "lt-05453df9000ac85e1"
      ~ image_id                             = "ami-062e38232f4d4253b" -> "ami-043b59f1d11f8f189"
      ~ latest_version                       = 17 -> (known after apply)
        name                                 = "infrahouse-github-backup20241009004627550500000004"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.data.aws_iam_policy_document.instance_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "instance_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:ModifyInstanceAttribute",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "openvpn-2024070518392010580000001e-nRBgZQ",
                ]
              + variable = "ec2:ResourceTag/aws:autoscaling:groupName"
            }
        }
    }

  # module.vpn.aws_autoscaling_group.openvpn will be updated in-place
  ~ resource "aws_autoscaling_group" "openvpn" {
        id                               = "openvpn-2024070518392010580000001e-nRBgZQ"
        name                             = "openvpn-2024070518392010580000001e-nRBgZQ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "16" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.vpn.aws_launch_template.openvpn will be updated in-place
  ~ resource "aws_launch_template" "openvpn" {
        id                                   = "lt-0f7a032c61f3f5094"
      ~ image_id                             = "ami-062e38232f4d4253b" -> "ami-043b59f1d11f8f189"
      ~ latest_version                       = 16 -> (known after apply)
        name                                 = "openvpn-2024070518392010580000001e"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
            "environment"       = "development"
            "service"           = "openvpn"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role.profile will be updated in-place
  ~ resource "aws_iam_role" "profile" {
        id                    = "jumphost-Zv01ElhajbB620240223005112032800000005"
        name                  = "jumphost-Zv01ElhajbB620240223005112032800000005"
      ~ tags                  = {
            "created_by_module" = "infrahouse/instance-profile/aws"
          + "module_version"    = "1.8.1"
        }
      ~ tags_all              = {
          + "module_version"    = "1.8.1"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.ssm[0] will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "jumphost-Zv01ElhajbB620240223005112032800000005"
    }

  # module.mail_twindb_com.module.instance-profile.aws_iam_role.profile will be updated in-place
  ~ resource "aws_iam_role" "profile" {
        id                    = "postfix-FyAJiotQPSDk20240326221547235800000003"
        name                  = "postfix-FyAJiotQPSDk20240326221547235800000003"
      ~ tags                  = {
            "created_by_module" = "infrahouse/instance-profile/aws"
          + "module_version"    = "1.8.1"
        }
      ~ tags_all              = {
          + "module_version"    = "1.8.1"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.mail_twindb_com.module.instance-profile.aws_iam_role_policy_attachment.ssm[0] will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "postfix-FyAJiotQPSDk20240326221547235800000003"
    }

  # module.vpn.module.instance_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/openvpn-8u1hU4OyuQDT20240705183937201200000024"
        name             = "openvpn-8u1hU4OyuQDT20240705183937201200000024"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:GetCallerIdentity"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "ec2:ModifyInstanceAttribute"
                      - Condition = {
                          - StringEquals = {
                              - "ec2:ResourceTag/aws:autoscaling:groupName" = "openvpn-2024070518392010580000001e-nRBgZQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "22" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (13 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ image_id                             = "ami-0619bc6dce9fffd70" -> "ami-053750f9b99df613d"
      ~ latest_version                       = 22 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 8 to add, 32 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDgsICJjaGFuZ2UiOiAzMiwgImRlc3Ryb3kiOiAyfX0=
```
</details>